tests/data/channel/channel_payments_list.json

{
  "data": [
    {
      "id": "97aef8f1-4948-43ef-b0be-c59cd62ad4ca",
      "paid_amount": "0.003",
      "paid_currency": "BTC",
      "received_amount": "0.00297",
      "received_currency": "BTC",
      "fee": "0.00003",
      "fee_currency": "BTC",
      "txid": "c6e5aac6a18e98eb9771ce0e394727aea516c8f66a3fc3c153ded3d7116dee3e",
      "status": "completed",
      "status_context": null,
      "refund_address": null,
      "coin_withdrawal_id": null,
      "custom_id": "2",
      "customer_id": null,
      "channel_id": "130c4b3c-7281-4cf6-852a-76a05b7b5315",
      "address": "2NDSMEM2dicJDb7xHjcxVGGz2xgzXeWGmRC",
      "risk": {
        "score": 7.33,
        "level": "medium",
        "resource_name": "default",
        "resource_category": "unknown"
      },
      "created_at": "2020-10-31T10:46:14+00:00"
    },
    {
      "id": "b2cef29d-0042-4837-85bf-02313569e6db",
      "paid_amount": "0.002",
      "paid_currency": "BTC",
      "received_amount": "0.0",
      "received_currency": "BTC",
      "fee": "0.0",
      "fee_currency": "BTC",
      "txid": "e1d7cba7cb8453af6528add8fb1f178383254214b1858f6484de289e7f98ef5d",
      "status": "on_hold",
      "status_context": "illicit_resource",
      "refund_address": null,
      "coin_withdrawal_id": null,
      "custom_id": "2",
      "customer_id": null,
      "channel_id": "130c4b3c-7281-4cf6-852a-76a05b7b5315",
      "address": "2NDSMEM2dicJDb7xHjcxVGGz2xgzXeWGmRC",
      "risk": {
        "score": 8.33,
        "level": "high",
        "resource_name": "default",
        "resource_category": "unknown"
      },
      "created_at": "2020-10-31T10:45:43+00:00"
    },
    {
      "id": "29aba759-3d5c-4c90-b559-9b59720c4649",
      "paid_amount": "0.001",
      "paid_currency": "BTC",
      "received_amount": "0.0",
      "received_currency": "BTC",
      "fee": "0.0",
      "fee_currency": "BTC",
      "txid": "9cec9bd1698fbf541e2f4bbae7d7c5dafb8d3c15ac2636e17ac7edb22fa092f2",
      "status": "on_hold",
      "status_context": "illicit_resource",
      "refund_address": null,
      "coin_withdrawal_id": null,
      "custom_id": "2",
      "customer_id": null,
      "channel_id": "130c4b3c-7281-4cf6-852a-76a05b7b5315",
      "address": "2NDSMEM2dicJDb7xHjcxVGGz2xgzXeWGmRC",
      "risk": {
        "score": 8.23,
        "level": "high",
        "resource_name": "default",
        "resource_category": "unknown"
      },
      "created_at": "2020-10-31T10:45:28+00:00"
    }
  ],
  "meta": {
    "total": 3,
    "has_more": false
  }
}
